tap 'homebrew/cask-drivers'
cask_args appdir: "/Applications"


# brew

brew 'atomicparsley'          # set itunes style matadata with alacrity
brew 'ctop'                   # top-like interface for container metrics
brew 'curl'                   # transfer data for url
brew 'docker'                 # docker
brew 'exiftool'               # edit metadata for image, audio, video and pdf
brew 'ffmpeg'                 # record, convert and stream audio and video
brew 'ghq'                    # remote repository management made easy
brew 'gist'                   # gist cli
brew 'git'                    # a distributed version control system
brew 'htop'                   # interactive text-mode process viewer
brew 'hub'                    # wrapper for git
brew 'jq'                     # json data viewer like sed
brew 'mackup'                 # application settings in sync
brew 'nkf'                    # network kanji fillter is string code transfer
brew 'openssl'                # secure sockets layer protocols
brew 'peco'                   # a simplistic interactive filtering tool
brew 'rmtrash'                # wrapper for rm
brew 'speedtest-cli'          # network speed test
brew 'sshrc'                  # wrapper ssh
brew 'imagemagick'            # create, edit, compose or convert bitmap images
brew 'telnet'                 # teletype network
brew 'tig'                    # wrapper for git
brew 'tree'                   # display directories as trees
brew 'tmux'                   # terminal multiplexer
brew 'youtube-dl'             # download videos from command-line
brew 'wget'                   # download contents 
brew 'z'                      # wrapper cd
brew 'zsh-completions'        # additional completion definitions for zsh
brew 'zsh'                    # unix shell

brew 'rbenv'                  # ruby environment
brew 'ruby-build'             # build any version of ruby
brew 'pyenv'                  # python environment
brew 'nodenv'                 # node.js enviroment 
brew 'mas'                    # mac app store command-line interface


# cask

cask 'aegisub'                # subtitle editor
cask 'arduino'                # arduino IDE
cask 'atom'                   # code editor
cask 'balenaetcher'           # OS images writer
cask 'blackhole'              # sound mixer
cask 'blender'                # 3D editor
cask 'brave-browser'          # chromium-based browser
cask 'calibre'                # ebook manager
cask 'clamxav'                # virus scanner
cask 'coconutbattery'         # battery health
cask 'coteditor'              # code editor
cask 'cyberduck'              # FTP client
cask 'daisydisk'              # disk space analyzer
cask 'db-browser-for-sqlite'  # sqlite viewer
cask 'deckset'                # markdown slide editor
cask 'discord'                # video audio text chat
cask 'docker'                 # docker
cask 'dropbox'                # cloud storage service
cask 'firefox'                # browser
cask 'geekbench'              # computer performance check
cask 'gimp'                   # image editor
cask 'github'                 # github client
cask 'google-chrome'          # chromium-based browser
cask 'gpg-suite'              # gpg keychain
cask 'handbrake'              # video convertor
cask 'iina'                   # video player
cask 'intel-power-gadget'     # cpu resource viewer
cask 'istat-menus'            # computer status viewer
cask 'istumbler'              # wi-fi signal viewer
cask 'iterm2'                 # terminal
cask 'karabiner-elements'     # keyboard customizer
cask 'keybase'                # gpg key server client
cask 'kicad'                  # pcb editor
cask 'kindle'                 # kindle book manager
cask 'lyrics-master'          # lyrics downloader
cask 'minecraft'              # sandbox game
cask 'music-manager'          # google play music client
cask 'musicbrainz-picard'     # music metadata downloader
cask 'obs'                    # video streamer
cask 'opera'                  # browser
cask 'resilio-sync'           # p2p data sync
cask 'simplenote'             # memo service
cask 'sourcetree'             # git client
cask 'subler'                 # mp4 metadata editor
cask 'sublime-text'           # code editor
cask 'teamspeak-client'       # audio text chat
cask 'the-unarchiver'         # file decompression
cask 'typora'                 # markdown editor
cask 'vagrant'                # virtual machine
cask 'virtualbox'             # virtualization
cask 'vlc'                    # video viewer
cask 'wireshark'              # packet viewer
cask 'xld'                    # audio converter


# cask quicklook plugin

cask 'webpquicklook'          # display webp image
cask 'quicklook-json'         # json viewer
cask 'quicklookase'           # view adobe swatch exchange
cask 'qlimagesize'            # image information viewer
cask 'qlstephen'              # binary data viewer
cask 'qlvideo'                # view most types of video 
cask 'qlmarkdown'             # markdown viewer
cask 'qlcolorcode'            # syntax highlight code viewer


# cask drivers

cask 'asix-ax88179'           # usb ethernet dongle driver
cask 'logitech-options'       # mouse option driver


# mas free

mas 'AmorphousMemoryMark', id: 1495719766 # disk speed tester
mas 'Speedtest by Ookla', id: 1153157709
mas 'LanScan', id: 472226235
mas 'Pages', id: 409201541
mas 'Numbers', id: 409203825
mas 'Todoist', id: 585829637
mas 'Xcode', id: 497799835
mas 'WannaAudio', id: 402366512
mas 'Photos Duplicate Cleaner', id: 592704001
mas 'Dato', id: 1470584107
mas 'Internet Access Policy Viewer', id: 1482630322
mas 'Skitch', id: 425955336


# mas purchased

mas 'Magnet', id: 441258766   # window manager

